Repository: Kevin64/asset-information-and-registration
Catalog: HardwareInformation/Properties/Strings.*.resx
Languages: pt

# ARGS_ERROR
source: One or more arguments contain errors! Exiting the program
pt: Um ou mais argumentos contém erros! Saindo do programa

# AUTH_ERROR
source: Authentication error! Exiting the program
pt: Erro de autenticação! Saindo do programa

# AUTH_INVALID
source: Invalid credentials. Try again.
pt: Credenciais inválidas. Tente novamente.

# BIOS_VERSION_ALERT
source: (Update firmware)
pt: (Atualizar firmware)

# CLI_BIOS_VERSION_ALERT
source: Firmware version:
pt: Versão do firmware:

# CLI_DATABASE_REACH_ERROR
source: Database connectivity:
pt: Conectividade com o banco de dados:

# CLI_FIRMWARE_TYPE_ALERT
source: Firmware type:
pt: Tipo de firmware:

# CLI_MEDIA_OPERATION_ALERT
source: SATA/M.2 operating mode:
pt: Modo de operação SATA/M.2:

# CLI_MEMORY_ALERT
source: RAM amount and number of slots:
pt: Memória RAM e nº de slots:

# CLI_NETWORK_IP_ERROR
source: IP address:
pt: Endereço IP:

# CLI_NETWORK_MAC_ERROR
source: MAC address:
pt: Endereço MAC:

# CLI_TPM_ALERT
source: TPM version:
pt: Versão do TPM:

# CLI_VT_ALERT
source: Virtualization Technology:
pt: Tecnologia de Virtualização:

# DATABASE_REACH_ERROR
source: Error contacting the database, check your intranet connection and that the web server is up!
pt: Erro ao contatar o banco de dados, verifique a sua conexão com a intranet e se o servidor web está ativo!

# DAYS_PASSED_TEXT
source: days since the last
pt: dias desde a última

# DEFAULT_HOSTNAME
source: CHANGE-NAME
pt: MUDAR-NOME

source: Employee
pt: Funcionário

# FETCHING
source: Collecting...
pt: Coletando...

# FETCH_AGAIN
source: Collect Again
pt: Coletar Novamente

# FIRMWARE_TYPE_ALERT
source: (Wrong firmware type)
pt: (Tipo de firmware incorreto)

# FIX_PROBLEMS
source: Fix the following issues before proceeding:
pt: Corrija os problemas a seguir antes de prosseguir:

# FORMAT_TEXT
source: formatting
pt: formatação

# HOSTNAME_ALERT
source: (Incorrect name, change)
pt: (Nome incorreto, alterar)

# INCORRECT_FUTURE_REGISTER_DATE
source: It is not possible to register for a date in the future.
pt: Não é possível registrar para uma data no futuro.

# INCORRECT_REGISTER_DATE
source: Registration date prior to the last maintenance date.
pt: Data de registro anterior à data da última manutenção.

# LOG_AUTOTHEME_CHANGE
source: Automatically selecting theme
pt: Selecionando tema automaticamente

# LOG_BIOS
source: Firmware version
pt: Versão do firmware

# LOG_BIOSTYPE
source: Firmware type
pt: Tipo de firmware

# LOG_BM
source: Brand
pt: Marca

# LOG_CHECKING_WEBVIEW2
source: Checking presence of WebView2 Runtime on the system
pt: Verificando presença do WebView2 Runtime no sistema

# LOG_CLI_MODE
source: Arguments detected, starting in CLI mode. list of arguments
pt: Argumentos detectados, iniciando em modo CLI. Lista de argumentos

# LOG_CLOSING_CLI
source: Ending program sequence
pt: Finalizando sequência do programa

# LOG_CLOSING_LOGINFORM
source: Finalizing login form
pt: Finalizando form de login

# LOG_CLOSING_MAINFORM
source: Finalizing main form
pt: Finalizando form principal

# LOG_DARKMODE_CHANGE
source: Switching to dark mode
pt: Mudando para modo escuro

# LOG_END_COLLECTING
source: Completion of hardware collection
pt: Finalização da coleta de hardware

# LOG_END_LOADING_WEBVIEW2
source: WebView2 Runtime loading finished
pt: Carregamento do WebView2 Runtime finalizado

# LOG_FETCHING_BIOSFILE
source: Getting file with hardware model information
pt: Obtendo arquivo com informações de modelo de hardware

# LOG_FETCHING_SERVER_DATA
source: Searching available buildings and types of hardware
pt: Buscando prédios e tipos de hardware disponíveis

# LOG_GPUINFO
source: Video card and vRAM
pt: Placa de Vídeo e vRAM

# LOG_GUI_MODE
source: Missing arguments, starting in GUI mode
pt: Argumentos ausentes, iniciando em modo GUI

# LOG_HARDWARE_PASSED
source: Compliant configuration, ready for registration
pt: Configuração sem pendências, pronto para registro

# LOG_HDSIZE
source: Storage (total space)
pt: Armazenamento (espaço total)

# LOG_HOSTNAME
source: Hostname
pt: Nome do Computador

# LOG_INIT_REGISTRY
source: Starting registration process
pt: Iniciando processo de registro

# LOG_INSTALLING_WEBVIEW2
source: Installing WebView2 Runtime
pt: Instalando WebView2 Runtime

# LOG_IP
source: NIC's IP Address
pt: Endereço IP do NIC

# LOG_LIGHTMODE_CHANGE
source: Switching to light mode
pt: Mudando para modo claro

# LOG_MAC
source: NIC's MAC Address
pt: Endereço MAC do NIC

# LOG_MEDIAOP
source: SATA/M.2 operating mode
pt: Modo de operação SATA/M.2

# LOG_MEDIATYPE
source: Storage type
pt: Tipo de armazenamento

# LOG_MODEL
source: Model
pt: Modelo

# LOG_OFFLINE_MODE
source: Offline execution mode
pt: Modo de execução offline

# LOG_OFFLINE_SERVER
source: Server is OFFLINE
pt: Servidor está OFFLINE

# LOG_ONLINE_SERVER
source: Server is ONLINE
pt: Servidor está ONLINE

# LOG_OPENING_LOG
source: Opening event log
pt: Abrindo log de eventos

# LOG_OS
source: Operating system
pt: Sistema Operacional

# LOG_PENDENCY_ERROR
source: Issues detected in the configuration
pt: Pendências detectadas na configuração

# LOG_PINGGING_SERVER
source: Checking server availability
pt: Verificando disponibilidade do servidor

# LOG_PM
source: RAM amount and number of slots
pt: Memória RAM e n° de slots

# LOG_PROCNAME
source: Processor and number of cores
pt: Processador e nº de núcleos

# LOG_REGISTERING
source: Registering on the Asset Control Server
pt: Registrando no servidor de controle patrimonial

# LOG_REGISTRY_FINISHED
source: Registration finished
pt: Registro finalizado

# LOG_RESETTING_INSTALLDATE
source: Recalculating last formatting date
pt: Recalculando data da última formatação

# LOG_RESETTING_MAINTENANCEDATE
source: Recalculating last maintenance date
pt: Recalculando data da última manutenção

# LOG_SAMEWORD_NOFIRSTREGISTRY
source: One or more 'same' arguments detected, however there is no existing record for the current asset. Computer must be registered first via GUI or via CLI with all command line options correctly filled in
pt: Um ou mais argumentos 'mesmo' detectados, porém não há registro existente para o patrimônio atual. Computador deve ser registrado primeiramente via GUI ou via CLI com todas as opções de linha de comando corretamente preenchidas

# LOG_SERIALNO
source: Serial Number
pt: Número Serial

# LOG_SERVER_DETAIL
source: Server and port
pt: Servidor e porta

# LOG_SHOWING_HELP
source: Displaying list of commands
pt: Exibindo lista de comandos

# LOG_SMART
source: S.M.A.R.T. status
pt: Status S.M.A.R.T.

# LOG_START_COLLECTING
source: Collecting hardware
pt: Coletando hardware

# LOG_START_LOADING_WEBVIEW2
source: Starting loading of WebView2 Runtime
pt: Iniciando carregamento do WebView2 Runtime

# LOG_START_THREAD
source: Initializing collection procedure thread
pt: Inicializando thread de procedimento de coleta

# LOG_THEME
source: Using dark theme
pt: Usando tema escuro

# LOG_TPM
source: TPM version
pt: Versão do TPM

# LOG_VIEW_SERVER
source: Accessing asset control system
pt: Acessando sistema de controle patrimonial

# LOG_VT
source: Virtualization Technology
pt: Tecnologia de Virtualização

# LOG_WEBVIEW2_ALREADY_INSTALLED
source: WebView2 Runtime is already installed
pt: WebView2 Runtime já está instalado

# LOG_WEBVIEW2_INSTALLED
source: WebView2 Runtime successfully installed
pt: WebView2 Runtime instalado com êxito

# LOG_WEBVIEW2_INSTALL_FAILED
source: WebView2 Runtime installation failed, please try again
pt: Falha na instalação do WebView2 Runtime, tente novamente

# LOG_WEBVIEW2_NOT_FOUND
source: WebView2 Runtime not found
pt: WebView2 Runtime não encontrado

# MAINTENANCE_TEXT
source: maintenance
pt: manutenção

# MANDATORY_FIELD
source: Fill in the required fields
pt: Preencha os campos obrigatórios

# MEDIA_OPERATION_ALERT
source: (Incorrect operating mode, change)
pt: (Modo de operação incorreto, alterar)

# MEDIA_OPERATION_IDE_RAID
source: IDE/Legacy or RAID
pt: IDE/Legacy ou RAID

# NETWORK_ERROR
source: Computer not connected to the Intranet
pt: Computador sem conexão com a Intranet

# NOT_ENOUGH_MEMORY
source: (Insufficient memory)
pt: (Memória insuficiente)

source: occupied
pt: ocupados

# OFFLINE_MODE_ACTIVATED
source: OFFLINE Mode!
pt: Modo OFFLINE!

# PENDENCY_ERROR
source: Resolve issues displayed in red!
pt: Resolva as pendências exibidas em vermelho!

# REGISTERING
source: Registering / Updating, please wait...
pt: Cadastrando / Atualizando, aguarde...

# REGISTER_AGAIN
source: Register / Update data
pt: Cadastrar / Atualizar dados

# replacedBattery
source: With battery change
pt: C/ troca de pilha

# sameBattery
source: No battery change
pt: S/ troca de pilha

# SECURE_BOOT_ALERT
source: (Enable secure boot)
pt: (Ativar secure boot)

# SERVER_PORT_ERROR
source: To access, select the server and the port!
pt: Para acessar, selecione o servidor e a porta!

# SINCE_UNKNOWN
source: (Could not determine date of last service)
pt: (Não foi possível determinar a data do último serviço)

source: slots of
pt: slots de

# SMART_FAIL
source: (Drive with imminent failure)
pt: (Drive com falha iminente)

source: Student
pt: Aluno

source: (Too much memory)
pt: (Memória em excesso)

# TPM_ERROR
source: (TPM disabled/incorrect version)
pt: (TPM desativado/versão incorreta)

# VT_ALERT
source: (Enable Virtualization Technology in firmware)
pt: (Ativar Tecnologia de Virtualização no firmware)
